backend/app/controllers/users_controller.rb

SELECT "users".* FROM "users" LIMIT ?  [["LIMIT", 1]]
---
  def index
    @users = User.all