app/controllers/doctors_controller.rb

SELECT "users".* FROM "users" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
    def set_user
      @user = User.find_by(params[:user_id])